{
    "version": "https://jsonfeed.org/version/1",
    "title": "Technical Blog",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Posts Relating to Full Stack Web Development",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/2020/06/25/chompr-proof-of-concept",
            "title": "chompr Pt. 1 -  Proof of concept",
            "summary": "Pt. 1 - Proof of concept",
            "content_text": "The starting pointI don’t think I’m alone in saying that my first foray into software development began when I had an idea for an app that I wanted bad enoughthat when I couldn’t find it, I decided to try and learn how to make it myself. A few months later I’ve learned a little enough to know that I knowprecious little, but I finally feel like I’m on a path where I can see the light at the end of the tunnel.I’m going to use these blog posts as an opportunity to chronicle the process of developing an app alongside developing a skillset. Let’s go!Chompr - Or, “IDK, what do you feel like?”I’ve spent way too many nights laying on the couch with a friend or partner doing the back-and-forth dance of “what are you in the mood to eat”. It’s a vicious cycle of hunger, indecision, and ultimately, the resignation of eventually landing on a choice that no one’s particularly excited for. Literally any alternative would be prefarable: a giant plinko board, prize wheel, or even… an app. Ideally an app that can help its users choose a meal option  easily  quickly  intuitively  fairly, with respect to each chooserAt this point, I’ve put together a wish list of features/functionality that I’d like to pursue, with varying degrees of complexity. Of course, it’s all pretty complex for me right now, but I’m attemping to tackle it in small chunks. For functionality, I’m hoping to build out an app that:  accepts a geographic location (user-input zipcode? cellular location data? Google web location data?)  allows for either delivery or take-out  accepts a number of choosers, with names for each (I think the process starts to break down with 5+ choosers)  provides the choosers with a randomized set of eight food categories (ie Thai, Korean, BBQ, Pub Fare)  randomly selects a chooser to select a category to eliminate, within a time limit (30 second?)  Once choosers have eliminated all but one option, the app instantiates a search for nearby restaurants in that category.I’ve got some stretch goals too, including user auth and API integration (grubhub? uber eats?). And any mobile development is firmly in the stretch category.Humble Beginnings - Let’s write some codeI’ve got a couple of big ol’ lists of stuff I don’t know how to do yet up there, but I can start buy building some base funcionality. First, let’s figure out a way to randomly generate eight food categories from a much larger “database” of catagories.def create_choices    options = %w[Thai Sushi Japanese Southern Korean Greek Armenian Italian Pizza Burgers     Sandwiches BBQ Mexican American Fast-Food Diner Chinese Pub-Fare]        mixed = options.shuffle        $choice_set = []    (0...8).map { |i| $choice_set.push(mixed[i]) }end",
            "content_html": "<h3 id=\"the-starting-point\">The starting point</h3><p>I don’t think I’m alone in saying that my first foray into software development began when I had an idea for an app that I wanted bad enoughthat when I couldn’t find it, I decided to try and learn how to make it myself. A few months later I’ve learned a little enough to know that I knowprecious little, but I finally feel like I’m on a path where I can see the light at the end of the tunnel.</p><p>I’m going to use these blog posts as an opportunity to chronicle the process of developing an app <em>alongside</em> developing a skillset. Let’s go!</p><h3 id=\"chompr---or-idk-what-do-you-feel-like\">Chompr - Or, “IDK, what do you feel like?”</h3><p>I’ve spent <strong>way</strong> too many nights laying on the couch with a friend or partner doing the back-and-forth dance of “what are you in the mood to eat”. It’s a vicious cycle of hunger, indecision, and ultimately, the resignation of eventually landing on a choice that no one’s particularly excited for. Literally any alternative would be prefarable: a giant plinko board, prize wheel, or even… an <strong>app</strong>. Ideally an app that can help its users choose a meal option</p><ul>  <li>easily</li>  <li>quickly</li>  <li>intuitively</li>  <li>fairly, with respect to each chooser</li></ul><p>At this point, I’ve put together a <em>wish list</em> of features/functionality that I’d like to pursue, with varying degrees of complexity. Of course, it’s all pretty complex for me right now, but I’m attemping to tackle it in small chunks. For functionality, I’m hoping to build out an app that:</p><ul>  <li>accepts a geographic location (user-input zipcode? cellular location data? Google web location data?)</li>  <li>allows for either delivery or take-out</li>  <li>accepts a number of choosers, with names for each (I think the process starts to break down with 5+ choosers)</li>  <li>provides the choosers with a randomized set of eight food categories (ie Thai, Korean, BBQ, Pub Fare)</li>  <li>randomly selects a chooser to select a category to eliminate, within a time limit (30 second?)</li>  <li>Once choosers have eliminated all but one option, the app instantiates a search for nearby restaurants in that category.</li></ul><p>I’ve got some stretch goals too, including user auth and API integration (grubhub? uber eats?). And any mobile development is firmly in the stretch category.</p><h3 id=\"humble-beginnings---lets-write-some-code\">Humble Beginnings - Let’s write some code</h3><p>I’ve got a couple of big ol’ lists of stuff I don’t know how to do yet up there, but I can start buy building some base funcionality. First, let’s figure out a way to randomly generate eight food categories from a much larger “database” of catagories.</p><figure class=\"highlight\"><pre><code class=\"language-ruby\" data-lang=\"ruby\">def create_choices    options = %w[Thai Sushi Japanese Southern Korean Greek Armenian Italian Pizza Burgers     Sandwiches BBQ Mexican American Fast-Food Diner Chinese Pub-Fare]        mixed = options.shuffle        $choice_set = []    (0...8).map { |i| $choice_set.push(mixed[i]) }end</code></pre></figure>",
            "url": "http://localhost:4000/2020/06/25/chompr-proof-of-concept",
            
            
            
            
            
            "date_published": "2020-06-25T00:00:00-05:00",
            "date_modified": "2020-06-25T00:00:00-05:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/06/22/second-test",
            "title": "A second test post",
            "summary": "oh god im testing im testing",
            "content_text": "boratboratborat  borat  borat",
            "content_html": "<p>borat<em>borat</em><em>borat</em></p><blockquote>  <p>borat</p>  <p><code>borat</code></p></blockquote>",
            "url": "http://localhost:4000/2020/06/22/second-test",
            
            
            
            
            
            "date_published": "2020-06-22T00:00:00-05:00",
            "date_modified": "2020-06-22T00:00:00-05:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/06/22/god-is-real",
            "title": "This is my test post",
            "summary": "This is my first sample post for my cool cool blog",
            "content_text": "This opera’s as lousy as it is brilliant! Your lyrics lack subtlety. You can’t just have your characters announce how they feel. That makes me feel angry!We need rest. The spirit is willing, but the flesh is spongy and bruised. How much did you make me? I love this planet! I’ve got wealth, fame, and access to the depths of sleaze that those things bring.This opera’s as lousy as it is brilliant! Your lyrics lack subtlety. You can’t just have your characters announce how they feel. That makes me feel angry! With a warning label this big, you know they gotta be fun!I love you, buddy!Moving along… Hi, I’m a naughty nurse, and I really need someone to talk to. $9.95 a minute. Look, last night was a mistake. I guess if you want children beaten, you have to do it yourself. Oh Leela! You’re the only person I could turn to; you’re the only person who ever loved me.Ok, we’ll go deliver this crate like professionals, and then we’ll go ride the bumper cars.It’s just like the story of the grasshopper and the octopus. All year long, the grasshopper kept burying acorns for winter, while the octopus mooched off his girlfriend and watched TV. But then the winter came, and the grasshopper died, and the octopus ate all his acorns. Also he got a race car. Is any of this getting through to you?You know, I was God once.Why did you bring us here?Uh, is the puppy mechanical in any way? Good man. Nixon’s pro-war and pro-family. When the lights go out, it’s nobody’s business what goes on between two consenting adults. Do a flip! I’m Santa Claus! When I was first asked to make a film about my nephew, Hubert Farnsworth, I thought “Why should I?” Then later, Leela made the film. But if I did make it, you can bet there would have been more topless women on motorcycles. Roll film!No argument here.Negative, bossy meat creature!When will that be?Stop it, stop it. It’s fine. I will ‘destroy’ you! I’m just glad my fat, ugly mama isn’t alive to see this day. I haven’t felt much of anything since my guinea pig died. Fatal.Large bet on myself in round one. Shut up and take my money! I wish! It’s a nickel. When will that be? You guys aren’t Santa! You’re not even robots. How dare you lie in front of Jesus? And remember, don’t do anything that affects anything, unless it turns out you were supposed to, in which case, for the love of God, don’t not do it!Man, I’m sore all over. I feel like I just went ten rounds with mighty Thor. Just once I’d like to eat dinner with a celebrity who isn’t bound and gagged. I suppose I could part with ‘one’ and still be feared…And when we woke up, we had these bodies. Why not indeed! I love you, buddy! You’re going back for the Countess, aren’t you?That could be ‘my’ beautiful soul sitting naked on a couch. If I could just learn to play this stupid thing. Also Zoidberg. You guys go on without me! I’m going to go… look for more stuff to steal!But, like most politicians, he promised more than he could deliver. Goodbye, cruel world. Goodbye, cruel lamp. Goodbye, cruel velvet drapes, lined with what would appear to be some sort of cruel muslin and the cute little pom-pom curtain pull cords. Cruel though they may be…Okay, it’s 500 dollars, you have no choice of carrier, the battery can’t hold the charge and the reception isn’t very… When will that be? Perhaps, but perhaps your civilization is merely the sewer of an even greater society above you!My fellow Earthicans, as I have explained in my book ‘Earth in the Balance’’, and the much more popular ‘‘Harry Potter and the Balance of Earth’, we need to defend our planet against pollution. Also dark wizards. You can see how I lived before I met you.Ok, we’ll go deliver this crate like professionals, and then we’ll go ride the bumper cars. Oh, all right, I am. But if anything happens to me, tell them I died robbing some old man. I’ll get my kit! And I’m his friend Jesus.Well I’da done better, but it’s plum hard pleading a case while awaiting trial for that there incompetence. Bender?! You stole the atom. Now what? Now Fry, it’s been a few years since medical school, so remind me. Disemboweling in your species: fatal or non-fatal?You’ll have all the Slurm you can drink when you’re partying with Slurms McKenzie! Why, those are the Grunka-Lunkas! They work here in the Slurm factory. You guys go on without me! I’m going to go… look for more stuff to steal!",
            "content_html": "<p>This opera’s as lousy as it is brilliant! Your lyrics lack subtlety. You can’t just have your characters announce how they feel. That makes me feel angry!We need rest. The spirit is willing, but the flesh is spongy and bruised. How much did you make me? I love this planet! I’ve got wealth, fame, and access to the depths of sleaze that those things bring.</p><p>This opera’s as lousy as it is brilliant! Your lyrics lack subtlety. You can’t just have your characters announce how they feel. That makes me feel angry! With a warning label this big, you know they gotta be fun!</p><p>I love you, buddy!Moving along… Hi, I’m a naughty nurse, and I really need someone to talk to. $9.95 a minute. Look, last night was a mistake. I guess if you want children beaten, you have to do it yourself. Oh Leela! You’re the only person I could turn to; you’re the only person who ever loved me.</p><p>Ok, we’ll go deliver this crate like professionals, and then we’ll go ride the bumper cars.It’s just like the story of the grasshopper and the octopus. All year long, the grasshopper kept burying acorns for winter, while the octopus mooched off his girlfriend and watched TV. But then the winter came, and the grasshopper died, and the octopus ate all his acorns. Also he got a race car. Is any of this getting through to you?You know, I was God once.Why did you bring us here?Uh, is the puppy mechanical in any way? Good man. Nixon’s pro-war and pro-family. When the lights go out, it’s nobody’s business what goes on between two consenting adults. Do a flip! I’m Santa Claus! When I was first asked to make a film about my nephew, Hubert Farnsworth, I thought “Why should I?” Then later, Leela made the film. But if I did make it, you can bet there would have been more topless women on motorcycles. Roll film!</p><p>No argument here.Negative, bossy meat creature!When will that be?Stop it, stop it. It’s fine. I will ‘destroy’ you! I’m just glad my fat, ugly mama isn’t alive to see this day. I haven’t felt much of anything since my guinea pig died. Fatal.</p><p>Large bet on myself in round one. Shut up and take my money! I wish! It’s a nickel. When will that be? You guys aren’t Santa! You’re not even robots. How dare you lie in front of Jesus? And remember, don’t do anything that affects anything, unless it turns out you were supposed to, in which case, for the love of God, don’t not do it!</p><p>Man, I’m sore all over. I feel like I just went ten rounds with mighty Thor. Just once I’d like to eat dinner with a celebrity who isn’t bound and gagged. I suppose I could part with ‘one’ and still be feared…</p><p>And when we woke up, we had these bodies. Why not indeed! I love you, buddy! You’re going back for the Countess, aren’t you?</p><p>That could be ‘my’ beautiful soul sitting naked on a couch. If I could just learn to play this stupid thing. Also Zoidberg. You guys go on without me! I’m going to go… look for more stuff to steal!</p><p>But, like most politicians, he promised more than he could deliver. Goodbye, cruel world. Goodbye, cruel lamp. Goodbye, cruel velvet drapes, lined with what would appear to be some sort of cruel muslin and the cute little pom-pom curtain pull cords. Cruel though they may be…</p><p>Okay, it’s 500 dollars, you have no choice of carrier, the battery can’t hold the charge and the reception isn’t very… When will that be? Perhaps, but perhaps your civilization is merely the sewer of an even greater society above you!</p><p>My fellow Earthicans, as I have explained in my book ‘Earth in the Balance’’, and the much more popular ‘‘Harry Potter and the Balance of Earth’, we need to defend our planet against pollution. Also dark wizards. You can see how I lived before I met you.</p><p>Ok, we’ll go deliver this crate like professionals, and then we’ll go ride the bumper cars. Oh, all right, I am. But if anything happens to me, tell them I died robbing some old man. I’ll get my kit! And I’m his friend Jesus.</p><p>Well I’da done better, but it’s plum hard pleading a case while awaiting trial for that there incompetence. Bender?! You stole the atom. Now what? Now Fry, it’s been a few years since medical school, so remind me. Disemboweling in your species: fatal or non-fatal?</p><p>You’ll have all the Slurm you can drink when you’re partying with Slurms McKenzie! Why, those are the Grunka-Lunkas! They work here in the Slurm factory. You guys go on without me! I’m going to go… look for more stuff to steal!</p>",
            "url": "http://localhost:4000/2020/06/22/god-is-real",
            
            
            
            
            
            "date_published": "2020-06-22T00:00:00-05:00",
            "date_modified": "2020-06-22T00:00:00-05:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}